{
  "backend/main.mo": "Actor exposing simple health check and version query endpoints.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend config, hooks, components, and crypto feature files.",
  "frontend/.env.example": "Example environment file documenting the crypto refresh interval variable with defaults and constraints.",
  "frontend/index.css": "Tailwind base styles defining OKLCH theme tokens for light and dark modes.",
  "frontend/index.html": "App HTML entry point mounting the React root and loading main.tsx.",
  "frontend/src/App.tsx": "Root app component rendering header, crypto dashboard, theme toggle, and backend health logging.",
  "frontend/src/components/ThemeToggle.tsx": "Button component that switches between light and dark themes using useTheme.",
  "frontend/src/features/crypto/CryptoDashboard.tsx": "Main dashboard with tabs, auto-refresh interval control, overview and prices views, and full market data rendering.",
  "frontend/src/features/crypto/CryptoPricesList.tsx": "Compact list component for the Prices tab showing rank, icon, name, symbol, and EUR price with skeleton states.",
  "frontend/src/features/crypto/cryptoRefreshInterval.ts": "Helper validating and exposing the effective crypto data refresh interval from environment variables.",
  "frontend/src/features/crypto/formatters.ts": "Utility functions formatting EUR prices, market cap, and volume values.",
  "frontend/src/features/crypto/RefreshIntervalSelector.tsx": "Button-group selector offering preset refresh intervals and emitting controlled value changes.",
  "frontend/src/features/crypto/types.ts": "Type definitions for crypto asset objects and market data responses.",
  "frontend/src/features/crypto/useCryptoMarketData.ts": "Fetches top 50 crypto market data from CoinGecko, filters and maps it to CryptoAsset, and exposes it via a React Query hook with configurable refresh interval.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state, login, and logout through a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Provides backend health and version queries using the current actor, enabled only when the actor is ready.",
  "frontend/src/hooks/useTheme.ts": "Stores and toggles a light/dark theme, syncing it with localStorage and applying the theme class to the document root.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes, applying global typography and color settings.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, extended theming using CSS variables, custom fonts, and plugins for typography, queries, and animations.",
  "project_state.json": "Describes project state, architecture decisions, known issues, and implemented features for the crypto tracking web app."
}