{
  "backend/main.mo": "Provides two public query endpoints for health status and version reporting.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files for reference or documentation.",
  "frontend/.env.example": "Documents environment variables, mainly the crypto refresh interval defaulting to 300000ms with minimum 1000ms.",
  "frontend/index.css": "Defines global Tailwind layers and color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML shell loading the frontend root element and main TypeScript entrypoint.",
  "frontend/src/App.tsx": "Root React component combining theme toggle, backend health check, and crypto dashboard layout.",
  "frontend/src/components/ThemeToggle.tsx": "Button component that switches between light and dark themes using useTheme.",
  "frontend/src/features/crypto/CryptoDashboard.tsx": "Dashboard UI showing crypto data table with refresh interval selector, loading states, and error handling.",
  "frontend/src/features/crypto/cryptoRefreshInterval.ts": "Parses and validates crypto refresh interval env var, supplying defaults and conversion helpers.",
  "frontend/src/features/crypto/RefreshIntervalSelector.tsx": "Renders selectable preset refresh interval buttons and emits changes via onChange.",
  "frontend/src/features/crypto/types.ts": "Defines TypeScript interfaces for crypto asset data and API response shapes.",
  "frontend/src/features/crypto/useCryptoMarketData.ts": "Fetches and maps CoinGecko market data with React Query using configurable refresh intervals.",
  "frontend/src/hooks/useActor.ts": "Creates and caches backend actors based on user identity, invalidating dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for calling backend actor methods to fetch health and version information.",
  "frontend/src/hooks/useTheme.ts": "Implements a light/dark theme hook with localStorage persistence and DOM class toggling.",
  "frontend/src/index.css": "Sets up Tailwind base layers and custom CSS variables for light/dark themes and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then mounts the app.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, theme extensions, custom colors from CSS variables, plugins, and animations.",
  "project_state.json": "Captures project metadata, current state, decisions, issues, and requirements for the crypto dashboard app."
}