{
  "kind": "build_request",
  "title": "Replace CoinGecko API provider and add Dark Mode toggle",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Replace the current CoinGecko market data fetch with an alternative public cryptocurrency market data REST API that does not require an API key, while keeping the dashboard behavior the same (top 50 by market cap, prices in EUR, refresh every 5 seconds). Update the data-mapping layer so the UI continues to receive the existing `CryptoAsset` fields used by `CryptoDashboard` (id, symbol, name, current_price, market_cap, market_cap_rank, price_change_percentage_24h, total_volume, image).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "Jah, vaheta API välja ja lisa lehele \"dark mode\""
        ]
      },
      "acceptanceCriteria": [
        "The app no longer calls the CoinGecko endpoint `https://api.coingecko.com/api/v3/coins/markets`.",
        "Market data loads successfully without requiring any API key configuration.",
        "The table still displays 50 assets ranked by market cap, with prices shown in EUR, and continues auto-refreshing every 5 seconds.",
        "`CryptoDashboard` renders without code changes needed for renamed/missing fields (i.e., the hook returns data shaped as the existing `CryptoAsset` interface).",
        "On non-2xx responses, the hook throws a descriptive error (status code + statusText) that surfaces in the existing error UI."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add a user-facing Dark Mode toggle to the dashboard UI and implement theme switching using Tailwind's class-based dark mode (toggling the `dark` class on the document root). Persist the user's preference across reloads (e.g., localStorage) and ensure all user-facing labels for the toggle are in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "Jah, vaheta API välja ja lisa lehele \"dark mode\""
        ]
      },
      "acceptanceCriteria": [
        "A visible theme toggle control is present in the UI (e.g., in the header).",
        "Toggling the control switches between light and dark themes by adding/removing the `dark` class on the root element.",
        "The chosen theme persists after page reload.",
        "The dashboard remains readable and visually consistent in both themes using the existing CSS variables in `frontend/src/index.css`.",
        "All user-facing toggle text is in English (e.g., \"Dark mode\", \"Light mode\")."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (compose existing shadcn components instead).",
    "Do not edit immutable frontend paths: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and `frontend/src/components/ui`.",
    "Keep the backend as a single Motoko actor in `backend/main.mo`; no backend changes are required for the API swap or theme toggle."
  ],
  "nonGoals": [
    "Adding price charts/sparklines.",
    "Adding third-party authentication providers beyond Internet Identity.",
    "Implementing real-time features via WebSockets or push notifications.",
    "Introducing a new backend data cache or external database."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}