{
  "kind": "build_request",
  "title": "Add a 'Prices only' tab to the crypto dashboard",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "Add a tabbed view to the crypto dashboard so users can switch between (1) the existing full market table view and (2) a new \"Prices\" view that displays only cryptocurrency prices.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "lisa \"tab\", kus kuvatakse ainult nende hindasi"
        ]
      },
      "acceptanceCriteria": [
        "The dashboard UI includes a clear tab control with two tabs labeled in English (e.g., \"Overview\" and \"Prices\").",
        "Switching tabs does not trigger a separate network request; both tabs reuse the existing `useCryptoMarketData` query result.",
        "The refresh interval selector and the loading spinner remain available and behave the same regardless of which tab is selected.",
        "The existing table view is preserved and remains the default selected tab on page load (unless otherwise specified in code)."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Implement the new \"Prices\" tab content to show a compact list that displays, for each of the top 50 assets: rank, coin icon, name, symbol, and current price in EUR, and does not show 24h change, market cap, or volume.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "lisa \"tab\", kus kuvatakse ainult nende hindasi"
        ]
      },
      "acceptanceCriteria": [
        "The \"Prices\" tab shows a vertical list (or similarly compact layout) of the same top 50 assets currently used by the dashboard.",
        "Each list row includes: market cap rank, coin image (with the existing placeholder behavior when image fails), asset name, symbol, and the formatted EUR price.",
        "No columns/fields for 24h change, market cap, or volume are shown in the \"Prices\" view.",
        "All user-facing labels/text added for this feature are in English.",
        "The \"Failed to load market data\" error state remains correct and is shown consistently for both tabs."
      ]
    }
  ],
  "constraints": [
    "Frontend changes must not modify any files under `frontend/src/components/ui` (compose existing UI components instead).",
    "Keep the backend as-is (single Motoko actor); this feature should be implemented purely in the frontend.",
    "Keep existing dashboard behavior (top 50 by market cap rank, EUR pricing, refresh interval control, dark mode) unchanged outside of adding the new tab/view."
  ],
  "nonGoals": [
    "Changing the market data provider or API endpoints.",
    "Adding new filters, sorting controls, searching, favorites, or watchlists.",
    "Adding persistence of selected tab across reloads (unless it is already trivial/implicit in the existing state management)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}