{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add tabbed Overview/Prices views to the crypto dashboard",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Add a tabbed control to the crypto dashboard to switch between the existing market overview table and a new Prices-only view while reusing the existing market data query and preserving refresh selector/spinner behavior.",
      "acceptanceCriteria": [
        "The dashboard UI includes a clear tab control with two tabs labeled in English (e.g., \"Overview\" and \"Prices\").",
        "Switching tabs does not trigger a separate network request; both tabs reuse the existing `useCryptoMarketData` query result.",
        "The refresh interval selector and the loading spinner remain available and behave the same regardless of which tab is selected.",
        "The existing table view is preserved and remains the default selected tab on page load (unless otherwise specified in code)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/crypto/CryptoDashboard.tsx",
          "operation": "modify",
          "description": "Introduce local UI state for the active tab (defaulting to the existing table/\"Overview\" view), render a composed tab control (do not modify anything under frontend/src/components/ui), and ensure `useCryptoMarketData` is called once with its results passed to the active tab content so switching tabs does not refetch."
        },
        {
          "path": "frontend/src/features/crypto/DashboardTabs.tsx",
          "operation": "create",
          "description": "Create a lightweight, dashboard-local tab control component (e.g., built by composing existing Button/Card primitives) that provides two English-labeled tabs (\"Overview\" and \"Prices\") and exposes controlled selection; do not add or modify files under frontend/src/components/ui."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Implement the new Prices tab content as a compact list of the top 50 assets showing rank, icon (with existing placeholder-on-error behavior), name, symbol, and formatted EUR price only, sharing loading/error behavior with the dashboard.",
      "acceptanceCriteria": [
        "The \"Prices\" tab shows a vertical list (or similarly compact layout) of the same top 50 assets currently used by the dashboard.",
        "Each list row includes: market cap rank, coin image (with the existing placeholder behavior when image fails), asset name, symbol, and the formatted EUR price.",
        "No columns/fields for 24h change, market cap, or volume are shown in the \"Prices\" view.",
        "All user-facing labels/text added for this feature are in English.",
        "The \"Failed to load market data\" error state remains correct and is shown consistently for both tabs."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/crypto/CryptoPricesList.tsx",
          "operation": "create",
          "description": "Create the Prices tab content component that renders a compact vertical list for up to 50 assets (rank, icon with placeholder fallback on image error, name, symbol, EUR price formatting consistent with the dashboard), and supports a loading skeleton state consistent with existing dashboard patterns."
        },
        {
          "path": "frontend/src/features/crypto/formatters.ts",
          "operation": "create",
          "description": "Add shared formatting helpers (e.g., EUR price formatting rules matching the existing dashboard) to keep Overview and Prices views consistent without duplicating logic."
        },
        {
          "path": "frontend/src/features/crypto/CryptoDashboard.tsx",
          "operation": "modify",
          "description": "Wire the new Prices view into the tabbed dashboard by rendering CryptoPricesList when the Prices tab is selected; ensure the existing destructive error state remains a single shared guard for both tabs and keep the refresh interval selector and loading spinner in the header unchanged."
        }
      ]
    }
  ]
}