{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Switch crypto market data provider to CoinPaprika (API key + resilient images)",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Replace CoinCap fetch with CoinPaprika while preserving current dashboard behavior and returning the existing CryptoAsset shape.",
      "acceptanceCriteria": [
        "The dashboard continues to render a table of 50 assets sorted by market cap rank (#1–#50).",
        "All displayed monetary values remain in EUR.",
        "React Query continues to refetch market data every 5 seconds while the page is open.",
        "`useCryptoMarketData()` still returns an array of `CryptoAsset` objects with fields: id, symbol, name, current_price, market_cap, market_cap_rank, price_change_percentage_24h, total_volume, image."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/crypto/useCryptoMarketData.ts",
          "operation": "modify",
          "description": "Replace the CoinCap provider implementation with CoinPaprika-based fetching and mapping while keeping: (1) top 50 assets by market cap rank, (2) EUR pricing fields, (3) React Query refetchInterval=5000 behavior, and (4) the returned `CryptoAsset[]` shape consumed by `CryptoDashboard`."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Add configurable CoinPaprika API key support and fail fast with a clear developer-facing error when missing/empty.",
      "acceptanceCriteria": [
        "When the API key is missing/empty at runtime, the app surfaces an explicit error that indicates an API key is required for CoinPaprika (no generic \"Failed to fetch\" only).",
        "When a valid API key is provided, the browser request succeeds without CORS errors and the table populates with live data.",
        "No user-facing UI copy is added in any language other than English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/crypto/useCryptoMarketData.ts",
          "operation": "modify",
          "description": "Add environment-driven API key support (e.g., via a Vite-style `import.meta.env` value) to the CoinPaprika request(s). Validate at runtime and throw a clear, developer-facing Error when the key is missing or empty; do not fall back to any other provider."
        },
        {
          "path": "frontend/.env.example",
          "operation": "create",
          "description": "Add an example environment file documenting the required CoinPaprika API key variable name and a short English-only note that the app will error at runtime if it is missing/empty."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Harden CoinPaprika-to-CryptoAsset image handling with safe fallbacks so missing/broken logos do not break layout or crash.",
      "acceptanceCriteria": [
        "If an asset image URL is missing or fails to load, the UI still renders rows without throwing errors.",
        "All rows in the table remain visually aligned even when some assets have no provider logo available."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/crypto/useCryptoMarketData.ts",
          "operation": "modify",
          "description": "Update the CoinPaprika-to-`CryptoAsset` mapping to always provide a deterministic, safe `image` URL string (provider logo when available; otherwise a stable placeholder) so consumers never receive undefined/null image values."
        },
        {
          "path": "frontend/src/features/crypto/CryptoDashboard.tsx",
          "operation": "modify",
          "description": "Add robust image rendering behavior for each row (e.g., an `onError` handler to switch to the placeholder image) to prevent runtime errors and keep table row alignment consistent when logos are missing or fail to load."
        }
      ]
    }
  ]
}